app/controllers/appointments_controller.rb

  def create
    @appointment = Appointment.new(appointment_params)

    respond_to do |format|
      if @appointment.save
---
INSERT INTO "appointments" ("visit", "Physician_id", "Patient_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["visit", "2019-10-29 01:59:00"], ["Physician_id", 1], ["Patient_id", 1], ["created_at", "2019-10-29 01:59:27.049825"], ["updated_at", "2019-10-29 01:59:27.049825"]]