app/views/appointments/_form.html.erb

    <%= form.label :Physician_id %>
    <%= form.collection_select :Physician_id, Physician.all, :id, :name %>
---
SELECT "physicians".* FROM "physicians"

    <%= form.label :Patient_id %>
    <%= form.collection_select :Patient_id, Patient.all, :id, :name %>
---
SELECT "patients".* FROM "patients"